Tekla Open API Reference for Tekla Structures 2025
Solid Properties
The Solid type exposes the following members.
Properties
Name | Description
MaximumPoint
 Gets the maximum axis-aligned point of the solid in the current plane.
MinimumPoint
 Gets the minimum axis-aligned point of the solid in the current plane.
Top
See Also
Reference
Solid Class
Tekla.Structures.Model Namespace